var APP_DATA = {
  "scenes": [
    {
      "id": "0-1-31",
      "name": "1 (31)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.05884507705519937,
          "pitch": 0.493678214667284,
          "rotation": 0,
          "target": "1-1-30"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "1-1-30",
      "name": "1 (30)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.0044253018178155,
          "pitch": 0.46641043936902093,
          "rotation": 0,
          "target": "0-1-31"
        },
        {
          "yaw": -1.6154586191089155,
          "pitch": 0.3759383965729963,
          "rotation": 0,
          "target": "2-1-28"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.2628162352479233,
          "pitch": -0.12158717416435394,
          "title": "<h2>История библиотеки</h2>",
          "text": "На территории будущего Вилючинска с конца 19 века Камчатское \nторгово-промышленное общество занималось рыбным промыслом. Здесь, в \nбухте Крашенинникова, ловили рыбу, торговали, обменивались. В 1901 году \nбыл построен первый рыбоконсервный завод полуострова. В 20-е годы 20 \nвека организовывались рыболовецкие колхозы, рыбозаводы и строились \nдеревянные поселки Старая Тарья, Новая Тарья, Сельдевая и Вилюй. Они \nбыстро пополнялись переселенцами из разных концов нашей страны. А в \nпоселках открывались библиотеки и избы-читальни. Были они совсем \nмаленькими, размещались в небольших домиках с печным отоплением.\n\n<p>В <b>1939 </b>году открылась библиотека в Новой Тарье. Читателями \nбыли работники Авачинского рыбокомбината, крупнейшего в то время \nрыбообрабатывающего предприятия Камчатки. Комбинат имел свой промысловый\n флот, рыбозаводы, рыболовные базы. По воспоминаниям старожилов, любимым\n местом отдыха жителей поселка были клуб и библиотека.</p>"
        }
      ]
    },
    {
      "id": "2-1-28",
      "name": "1 (28)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.7489629609867325,
          "pitch": 0.4574617547526554,
          "rotation": 0,
          "target": "1-1-30"
        },
        {
          "yaw": -0.17772836358336974,
          "pitch": 0.46250055798300593,
          "rotation": 0,
          "target": "3-1-22"
        },
        {
          "yaw": -1.406628592814485,
          "pitch": 0.1897423369293776,
          "rotation": 0,
          "target": "9-1-27"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.6891888764781342,
          "pitch": -0.042446432123650624,
          "title": "<div><br></div>",
          "text": "<p>В <b>1940</b> году открылись библиотеки в колхозах \"Вилюй\" и имени \nСталина (Сельдевая). Интересно то, что на территории будущего города \nпервыми библиотекарями были мужчины. Вилюйской библиотекой заведовал \n19-летний комсомолец, студент-заочник библиотечного техникума Лепехин \nТихон Петрович. Библиотечное дело в Сельдевой начинал 27-летний Павел \nГригорьевич Морозов. Роль изб-читален и библиотек особенно возросла в \nвоенные годы. Настоящим боевым агитпунктом стала изба-читальня в колхозе\n им. Сталина (в библиотеку она реорганизована в 1944 году). Ушедшего на \nфронт Морозова заменил библиотекарь Котомин. Он всегда шел туда, где \nработали колхозники - в поле, на рыбалку. Там читал сообщения \nСовинформбюро, делал доклады и своим словом поднимал людей на \nсамоотверженный труд.</p>\n\n<p>В 30-40-е годы, судя по архивным документам, книжные фонды были \nбедны, библиотечных работников не хватало, их квалификация была низка. В\n 50-е картина меняется. Наладилась послевоенная, мирная жизнь, люди \nпотянулись к культуре и знаниям.</p>"
        }
      ]
    },
    {
      "id": "3-1-22",
      "name": "1 (22)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.004380933436937795,
          "pitch": 0.3459923667918332,
          "rotation": 0,
          "target": "4-1-17"
        },
        {
          "yaw": -3.0229114721251538,
          "pitch": 0.41843510378559756,
          "rotation": 0,
          "target": "2-1-28"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "4-1-17",
      "name": "1 (17)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.06810097548829219,
          "pitch": 0.4280379396814311,
          "rotation": 0,
          "target": "5-1-21"
        },
        {
          "yaw": 2.903682758906209,
          "pitch": 0.42613962943819317,
          "rotation": 0,
          "target": "3-1-22"
        },
        {
          "yaw": -1.5859926206245412,
          "pitch": 0.1943322953947959,
          "rotation": 0,
          "target": "13-1-16"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.7592494967763628,
          "pitch": 0.035821076041811395,
          "title": "Развивайка",
          "text": "Читальный зал<br>"
        }
      ]
    },
    {
      "id": "5-1-21",
      "name": "1 (21)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 3.004468125874812,
          "pitch": 0.39433114456362617,
          "rotation": 0,
          "target": "4-1-17"
        },
        {
          "yaw": 0.738793341887618,
          "pitch": 0.3101732058195772,
          "rotation": 0,
          "target": "6-1-20"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.0175881790767587,
          "pitch": -0.3340755855445945,
          "title": "<br>",
          "text": "В бухту Крашенинникова в 1938 году пришли первые подводные лодки, и \nпоявился поселок военных моряков Рыбачий. Здесь в 1960 году построили \nбазовый матросский клуб, в нем открылась библиотека. Читателями были \nматросы, офицеры и их семьи. Мужчины выполняли свой долг, женщины \nвоспитывали детей, участвовали в художественной самодеятельности, много \nчитали. При библиотеке был создан драмкружок, ставили отрывки из пьес, \nпроводили поэтические вечера. В колхоз им. Сталина приехали первые \nспециалисты с библиотечным образованием - выпускницы Хабаровской \nкультшколы Гужина Мария Ивановна и Камоцкая Лидия Ивановна. Книжный фонд\n библиотеки увеличился до трех тысяч экземпляров, выписывали большое \nколичество газет и журналов. Появились новые формы в массовой работе - \nустные журналы, литературные вечера."
        },
        {
          "yaw": -0.7596128827728972,
          "pitch": -0.08173521495184843,
          "title": "Клуб любителей поэзии<br>",
          "text": "<br><img alt=\"\" src=\"https://villib.ru/pics/static/history/hist3.jpg\">"
        }
      ]
    },
    {
      "id": "6-1-20",
      "name": "1 (20)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.8731567842262624,
          "pitch": 0.2791825370236083,
          "rotation": 0,
          "target": "5-1-21"
        },
        {
          "yaw": 1.1344277162254954,
          "pitch": 0.3270121357193858,
          "rotation": 0,
          "target": "7-1-19"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.5212384115407076,
          "pitch": 0.03899283575077561,
          "title": "<div><br></div>",
          "text": "Размещение на Камчатке военно-морской базы потребовало создания и \nразвития судоремонта. Вышел приказ главнокомандующего ВМФ о \nстроительстве завода, ремонтирующего военные корабли. Рыбаков с \nпобережья переселили: закрыли рыбозавод и рыбокомбинат, колхоз им. \nСталина вошел в состав колхоза им. Ленина (пос. Сероглазка). Библиотеку \nтакже закрыли, книжный фонд передали в библиотеку профкома \nсудоремонтного завода. Являясь профсоюзной, она, по сути, была массовой,\n так как обслуживала не только заводчан, но и все население Сельдевой и \nстроящегося района Приморского. В 1966 году ее книжный фонд насчитывал \nоколо 10 тысяч экземпляров, она обслуживала до 5000 читателей в год. В \n1968 году штат библиотеки увеличился до 2-х работников. В цехах \nустраивали выставки-просмотры новых поступлений, совместно с обществом \n\"Знание\" вели лекторскую работу. Перед демонстрацией фильмов в клубе \nпроводили беседы о творчестве писателей, библиографические обзоры."
        },
        {
          "yaw": -1.6278881283318878,
          "pitch": 0.07508768723143433,
          "title": "<br>",
          "text": "С образованием городского отдела культуры библиотечное дело Вилючинска \nначинает набирать силу. Открываются городские библиотеки, количество \nбиблиотечных кадров увеличивается. В 1971 году распахнула двери новая \nгородская библиотека № 1. Ее книжный фонд составлял 3900 экземпляров. \nРаботал абонемент, небольшой читальный зал и детское отделение. На \nпредприятиях и в организациях, в военно-спортивном лагере \"Зарница\" \nначали работать передвижные библиотеки и пункты выдачи литературы."
        },
        {
          "yaw": -1.4136270105436104,
          "pitch": 0.08595631913472701,
          "title": "<br>",
          "text": "Первой заведующей была Крючкова Л. М., в читальном зале - Назарько Т. \nЯ., в детском отделении - Мартинец В.А. Они вели большую массовую \nработу: устные журналы, обзоры, беседы о книгах. В читальном зале \nорганизовали первую выставку картин местного художника Виталия Шохина \n(ныне заслуженный работник культуры, член Союза художников СССР). В \nпервый год работы библиотеку посетило 1500 читателей. Книжный фонд к \nконцу года насчитывал 9000 экземпляров. На базе библиотеки открылся \nлекторий правовых знаний."
        },
        {
          "yaw": -0.9746279669448583,
          "pitch": 0.08364355000603219,
          "title": "<br>",
          "text": "С января <b>1971</b> года сельская библиотека Рыбачего переименовывается в городскую библиотеку № 2 (ныне <a href=\"https://villib.ru/index/filial_1/0-5\" target=\"_blank\">филиал №&nbsp;1</a>).\n В ней работали 4 человека: заведующая Савчик Александра Ивановна и \nбиблиотекари Евглевская Р.И., Скрыпникова И.Г., Зверякова Е.П. Было \nвыделено детское отделение. В <b>1976</b> году на его базе открылась самостоятельная детская библиотека (<a href=\"https://villib.ru/index/filial_3/0-8\" target=\"_blank\">филиал №&nbsp;3</a>). 7 лет здесь работал детский клуб \"Патриот\", большинство заседаний проходило в музее Боевой славы."
        }
      ]
    },
    {
      "id": "7-1-19",
      "name": "1 (19)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.9879731619085224,
          "pitch": 0.3771770108725008,
          "rotation": 0,
          "target": "6-1-20"
        },
        {
          "yaw": 0.1823334364201692,
          "pitch": 0.2524027637426549,
          "rotation": 0,
          "target": "8-1-18"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.5177913561977032,
          "pitch": 0.39426550943511174,
          "title": "Городская библиотека. Встреча первых читателей<br>",
          "text": "<img alt=\"\" src=\"https://villib.ru/pics/static/history/hist6.jpg\">"
        },
        {
          "yaw": 0.9672593182441087,
          "pitch": 0.3399771365424922,
          "title": "<br>",
          "text": "<figure class=\"sign_l\"><img alt=\"\" src=\"https://villib.ru/pics/static/history/hist8.jpg\"></figure>\n\n"
        }
      ]
    },
    {
      "id": "8-1-18",
      "name": "1 (18)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 3.1143830802610655,
          "pitch": 0.510017712672667,
          "rotation": 0,
          "target": "7-1-19"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.8382759296437001,
          "pitch": -0.14238210790942674,
          "title": "<br>",
          "text": "В <b>1973</b> году в двухкомнатной квартире жилого дома открылась \nдетская библиотека района Приморского. Штат ее состоял из двух человек. В\n первый год своей работы библиотека обслужила 943 читателя и выдала 15 \n000 экземпляров. Было оформлено 26 книжных выставок, проведено 9 бесед и\n громких чтений, 8 обзоров, 6 утренников, 2 обсуждения книг, оформлен 1 \nбиблиотечный плакат. Составлены рекомендательные списки литературы по \nклассам, начата работа с трудновоспитуемыми ребятами"
        },
        {
          "yaw": 0.7232229593026016,
          "pitch": -0.18397289963709618,
          "title": "<br>",
          "text": "В <b>1976</b> году для обслуживания жителей военного гарнизона \nБогатыревка открылась городская библиотека № 3. Эта маленькая библиотека\n долгие годы была единственным очагом культуры отдаленного микрорайона \n(закрыта в конце 1990-х годов в связи с ликвидацией гарнизона)."
        }
      ]
    },
    {
      "id": "9-1-27",
      "name": "1 (27)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.12309252002923543,
          "pitch": 0.29515072228183925,
          "rotation": 0,
          "target": "10-1-26"
        },
        {
          "yaw": -1.8602248303502105,
          "pitch": 0.20483487958816582,
          "rotation": 0,
          "target": "11-1-23"
        },
        {
          "yaw": -3.0925515234675345,
          "pitch": 0.1315215077984604,
          "rotation": 0,
          "target": "2-1-28"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.13516965950425863,
          "pitch": 0.13022389728055295,
          "title": "Узнавайка <br>",
          "text": "Гостиная"
        },
        {
          "yaw": 0.867824853576149,
          "pitch": -0.10338380210606246,
          "title": "<br>",
          "text": "Особым событием в жизни массовых библиотек можно считать переход на централизацию. 1 августа <b>1978</b> года пять городских библиотек объединились в <a href=\"https://villib.ru/\" target=\"_blank\">ЦБС</a>. Библиотека №1 становится <a href=\"https://villib.ru/index/centralnaja_gorodskaja_biblioteka/0-92\" target=\"_blank\">Центральной</a>\n в библиотечной системе и методическим центром для всех библиотек \nгорода. В штате вводятся новые должности: методист, библиограф, \nхудожник. Открывается новое подразделение - группа комплектования и \nобработки литературы. Коллектив библиотеки, работая профессионально, \nтворчески, достиг неплохих результатов. В <b>1988</b> году ей присвоено звание «Библиотека отличной работы», а в <b>1990</b>-м она заняла 1-е место в областном смотре-конкурсе «День специалиста - работника культуры»."
        },
        {
          "yaw": 1.2286175818789928,
          "pitch": -0.12841036074303425,
          "title": "Профессиональный библиотечный<br>\nконкурс «Знатоки Руси»",
          "text": "\n\n<img alt=\"\" src=\"https://villib.ru/pics/static/history/hist9.jpg\">"
        }
      ]
    },
    {
      "id": "10-1-26",
      "name": "1 (26)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 3.1091518184117755,
          "pitch": 0.26178229497104155,
          "rotation": 0,
          "target": "9-1-27"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.7208371338387565,
          "pitch": -0.35098922157127,
          "title": "<br>",
          "text": "<p>2 января <b>1989</b> года в военном совхозе \"Ягодный\" была открыта \nбиблиотека-филиал № 4 - единственное учреждение культуры в микрорайоне. \nЕе первой и бессменной заведующей все годы была И.Г Белоглазова. Но в \nсилу ряда объективных обстоятельств (ликвидация совхоза, отъезд жителей)\n в 1998 году библиотека была реорганизована в пункт выдачи литературы, а\n вскоре закрыта совсем.</p>\n\n<p>В <b>1991</b> году в составе ЦБС появляются новые филиалы: <a href=\"https://villib.ru/index/filial_5/0-9\" target=\"_blank\">№&nbsp;5</a> (бывшая библиотека профкома судоремонтного завода) и <a href=\"https://villib.ru/index/filial_6/0-10\" target=\"_blank\">№&nbsp;6</a> - библиотека передвижной работы. 1 апреля 1993 года открылся самый молодой <a href=\"https://villib.ru/index/filial_7/0-11\" target=\"_blank\">филиал №&nbsp;7</a>.</p>"
        }
      ]
    },
    {
      "id": "11-1-23",
      "name": "1 (23)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.101154271813944,
          "pitch": 0.16631371455158295,
          "rotation": 0,
          "target": "12-1-24"
        },
        {
          "yaw": 0.11484066481266098,
          "pitch": 0.3415996778782784,
          "rotation": 0,
          "target": "9-1-27"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.588288752015604,
          "pitch": -0.30692398086207184,
          "title": "Отдыхайка",
          "text": "Библиотечный планетарий<br>"
        }
      ]
    },
    {
      "id": "12-1-24",
      "name": "1 (24)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.1057268861851686,
          "pitch": 0.1051692305826073,
          "rotation": 0,
          "target": "11-1-23"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "13-1-16",
      "name": "1 (16)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 3.1393745129019672,
          "pitch": 0.31062143955565347,
          "rotation": 0,
          "target": "4-1-17"
        },
        {
          "yaw": -0.7582567070702293,
          "pitch": 0.40237545607823755,
          "rotation": 0,
          "target": "14-1-15"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.18908543729058103,
          "pitch": 0.1293122182270814,
          "title": "Читайка",
          "text": "Абонемент"
        },
        {
          "yaw": 1.220540973075785,
          "pitch": -0.41113420876079587,
          "title": "<br>",
          "text": "Девяностые годы - качественно новый этап в жизни ЦБС, поиск дальнейших путей развития, новых форм работы. В <b>1994</b> году ЦБС Вилючинска становится победителем областного конкурса на лучшую библиотечную рекламу, а в <b>1999</b>\n году - победителем в конкурсе работы библиотек Камчатской области, \nпосвященном 200-летию со дня рождения А.С.Пушкина. Библиотеки стремились\n стать как информационными центрами, так и центрами культурного и \nдуховного общения. Собирали людей, объединенных общими интересами, \nсоздавали клубы: «Познай себя сам», «Всей семьей в библиотеку», \n«Хозяюшка» и др."
        }
      ]
    },
    {
      "id": "14-1-15",
      "name": "1 (15)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.5448327345632826,
          "pitch": 0.4785123775519491,
          "rotation": 0,
          "target": "15-1-14"
        },
        {
          "yaw": 0.8724047427872677,
          "pitch": 0.39242678408360376,
          "rotation": 0,
          "target": "17-1-12"
        },
        {
          "yaw": -2.439194643818407,
          "pitch": 0.3980772818429692,
          "rotation": 0,
          "target": "13-1-16"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "15-1-14",
      "name": "1 (14)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.878177227667136,
          "pitch": 0.655459982926768,
          "rotation": 0,
          "target": "14-1-15"
        },
        {
          "yaw": -0.2977958494917008,
          "pitch": 0.42242527018856535,
          "rotation": 0,
          "target": "16-1-13"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.0318720048775916,
          "pitch": -0.28715645319227967,
          "title": "<h3>Библиотека в 21 веке</h3>",
          "text": "Администрация города никогда не оставляла без внимания нужды библиотечной системы. В <b>2000</b> году для центральных библиотек было выделено помещение бывшего КБО по адресу: ул. Приморская, д.&nbsp;6. В <b>2001</b>\n году библиотеки были включены в государственную программу развития \nзакрытых городов «Библиотека 21-го века – центр информации и культуры»."
        }
      ]
    },
    {
      "id": "16-1-13",
      "name": "1 (13)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.8213213285357384,
          "pitch": 0.49088475276904653,
          "rotation": 0,
          "target": "15-1-14"
        },
        {
          "yaw": 1.204918738441009,
          "pitch": 0.31027250871566636,
          "rotation": 0,
          "target": "19-1-10"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.1343734950779485,
          "pitch": -0.4029008886460552,
          "title": "<br>",
          "text": "В сентябре <b>2003</b> года в этих стенах состоялось выездное заседание \nМеждународной конференции «Программа ЮНЕСКО «Информация для всех: \nразвитие национальной и международной информационной политики»"
        }
      ]
    },
    {
      "id": "17-1-12",
      "name": "1 (12)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.7900719378458847,
          "pitch": 0.5707589298990339,
          "rotation": 0,
          "target": "14-1-15"
        },
        {
          "yaw": -1.6363217471538398,
          "pitch": 0.5670151292687144,
          "rotation": 0,
          "target": "18-1-11"
        },
        {
          "yaw": -0.24256403640247726,
          "pitch": 0.24382102903973646,
          "rotation": 0,
          "target": "20-1-9"
        },
        {
          "yaw": 1.4346222757653466,
          "pitch": 0.3224895977849762,
          "rotation": 0,
          "target": "22-1-7"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.9251883348271637,
          "pitch": 0.010351904243703913,
          "title": "Пришло время компьютеров и Интернета",
          "text": "В апреле <b>2000</b> года в Центральной городской библиотеке установлен \nпервый компьютер с принтером (передан городской администрацией). В мае \nприобретён второй, а 28 марта <b>2003</b> года открылась уже для читателей медиатека ЦГБ (первый руководитель — Звонарёва Ирина Владимировна). В <b>2007</b> году филиал №&nbsp;1 в Рыбачьем получил доступ в Интернет. В сентябре <b>2009</b> года начал действовать Сайт ЦБС"
        },
        {
          "yaw": 1.3270927135501402,
          "pitch": -0.07611945402816644,
          "title": "Хранилище книг<br>",
          "text": "В этом месте хранится большая часть книг библиотеки<br>"
        }
      ]
    },
    {
      "id": "18-1-11",
      "name": "1 (11)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 3.027789715027872,
          "pitch": 0.596999319641883,
          "rotation": 0,
          "target": "17-1-12"
        },
        {
          "yaw": -0.17025852788867546,
          "pitch": 0.38467545121669033,
          "rotation": 0,
          "target": "19-1-10"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.9342862783059758,
          "pitch": -0.2741399945769931,
          "title": "Title",
          "text": "В <b>2007–2008</b> годах работала программа «Вилючинск читающий». Итоги подвели в октябре <b>2008</b> года, когда Центральная библиотека провела общегородской День чтения. С <b>2009</b>\n года ЦГБ проводит традиционный городской конкурс «Я с книгой у \nкомпьютера», в ходе которого читателями создаются творческие работы с \nиспользованием новых информационных технологий. Участники конкурса \nпробуют разные форматы: презентации, иллюстрации, исследовательские \nпроекты, видеофильмы, мультфильмы. Среди проектов есть и интерактивные \nкниги, литературные игры, викторины, кроссворды, видеоскрайбинг. В <b>2019</b> году конкурс «Я с книгой у компьютера» отметил своё первое десятилетие."
        }
      ]
    },
    {
      "id": "19-1-10",
      "name": "1 (10)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.4321160615592374,
          "pitch": 0.4483741481384662,
          "rotation": 0,
          "target": "18-1-11"
        },
        {
          "yaw": -0.13243981155461348,
          "pitch": 0.27272250948119137,
          "rotation": 0,
          "target": "21-1-8"
        },
        {
          "yaw": 3.0244061562860516,
          "pitch": 0.462491402297184,
          "rotation": 0,
          "target": "16-1-13"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.9841075443768865,
          "pitch": -0.1610960641846937,
          "title": "Историко-краеведческая конференция<br>\n«Послужим, братья, мы Отечеству!»",
          "text": "<img alt=\"\" src=\"https://villib.ru/pics/arch_pcs/conf155/ppl.gif\">"
        }
      ]
    },
    {
      "id": "20-1-9",
      "name": "1 (9)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.060549162039645665,
          "pitch": 0.2554897950239656,
          "rotation": 0,
          "target": "17-1-12"
        },
        {
          "yaw": 0.6206823011299409,
          "pitch": 0.43336138698551885,
          "rotation": 0,
          "target": "21-1-8"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.895349760641448,
          "pitch": 0.03540204918660805,
          "title": "<br>",
          "text": "Продолжается активная деятельность ЦБС в краеведческом направлении. \nБиблиотекари выступают собирателями и хранителями истории города. \nТрадиционными становятся городские конференции, требовавшие огромной \nподготовительной работы: <b>2002</b> год – эколого-краеведческая «Не забывать проблем родного края»; <b>2003</b> год – военно-историческая «Подводный флот и история города»; <b>2005</b> год – историко-краеведческая «О войне написано не все…» и др.<br>"
        },
        {
          "yaw": -2.0198708790343645,
          "pitch": 0.17288747882473743,
          "title": "<br>",
          "text": "Библиотечная система ВГО активно участвует в жизни горожан. Для \nвыполнения основной задачи – оперативного информационно-библиотечного \nобслуживания пользователей в соответствии с их потребностями – \nбиблиотеки, наряду с традиционными, активно развивают новые \nинформационные технологии. Кроме этого библиотеки все больше приобретают\n функции досугового центра, места встреч, общения. Этому способствовало и\n улучшение условий работы – в Рыбачьем в августе <b>2011</b> года детская библиотека-филиал №&nbsp;3 перешла в новое помещение, а в <b>2012</b> и филиал №&nbsp;1."
        },
        {
          "yaw": -1.055927962948136,
          "pitch": 0.26356106902828635,
          "title": "Мы в ВК<br>",
          "text": "https://vk.com/villibrary"
        }
      ]
    },
    {
      "id": "21-1-8",
      "name": "1 (8)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.05925430323286207,
          "pitch": 0.5475869863823348,
          "rotation": 0,
          "target": "19-1-10"
        },
        {
          "yaw": -1.4696934637038694,
          "pitch": 0.44468398276293186,
          "rotation": 0,
          "target": "20-1-9"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "22-1-7",
      "name": "1 (7)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.715867431752752,
          "pitch": 0.28839942491470794,
          "rotation": 0,
          "target": "17-1-12"
        },
        {
          "yaw": 0.16352029538869495,
          "pitch": 0.23457216001730963,
          "rotation": 0,
          "target": "23-1-6"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "23-1-6",
      "name": "1 (6)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.8489829066060812,
          "pitch": 0.3423774975406495,
          "rotation": 0,
          "target": "22-1-7"
        },
        {
          "yaw": 0.20769132829276948,
          "pitch": 0.5952379934885421,
          "rotation": 0,
          "target": "24-1-5"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.6921076682125147,
          "pitch": 0.30123046229507366,
          "title": "Раздвижные стеллажи<br>",
          "text": "Крути ручку и тебе откроется прекрасный книжный мир!<br>"
        },
        {
          "yaw": -2.1103864066684075,
          "pitch": -0.1804343368505812,
          "title": "<b>Книгу</b> читай, разуму набирай.",
          "text": "<br>"
        },
        {
          "yaw": 2.728703341196498,
          "pitch": -0.21954122605362159,
          "title": "Будешь книжки читать, будешь все знать.",
          "text": "<br>"
        },
        {
          "yaw": -1.5348931212150685,
          "pitch": -0.17039538032828538,
          "title": "Не красна книга письмом, а красна умом.",
          "text": "<br>"
        }
      ]
    },
    {
      "id": "24-1-5",
      "name": "1 (5)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.9473097672658177,
          "pitch": 0.664265026995043,
          "rotation": 0,
          "target": "23-1-6"
        },
        {
          "yaw": 1.7426283382107561,
          "pitch": 0.3726022921401757,
          "rotation": 0,
          "target": "25-1-4"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "25-1-4",
      "name": "1 (4)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.16516490293934183,
          "pitch": 0.3880897043838658,
          "rotation": 0,
          "target": "24-1-5"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.1024769300357136,
          "pitch": -0.25173508604636474,
          "title": "<b>Книга</b> твой друг, без нее как без рук.",
          "text": "<br>"
        },
        {
          "yaw": 1.8040424149662622,
          "pitch": -0.20239685792994422,
          "title": "<b>Книга</b> в счастье украшает, а в несчастье утешает.",
          "text": "Text"
        },
        {
          "yaw": -1.4626489374541602,
          "pitch": -0.3501618415017589,
          "title": "Прочел хорошую <b>книгу</b> - встретился с другом.",
          "text": "<br>"
        },
        {
          "yaw": 0.7879880055423154,
          "pitch": -0.2478203428132595,
          "title": "Хорошая <b>книга</b> ярче звездочки светит.",
          "text": "<br>"
        }
      ]
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
